const textForEvents = {
  1: [ // 共乘
    '沒有進行中的共乘？這正是你發起共乘，成為全場焦點的好時機！',
    '還在孤單地與車費搏鬥嗎？發起共乘，讓你的荷包喘口氣！',
    '都不符合需求?別等了!創建新的共乘，邀請順路的朋友一同出發！',
    '沒有進行中的共乘?不如你來發起吧,或許也有人要去同樣的地方!',
    '找不到合適的共乘?別擔心,你也能成為發起人,號召其他人加入!',
    ],
    2: [ // 運動
    '今天想挑戰什麼?跑步、羽球、瑜珈?勇敢發起,找到你的運動夥伴!',
    '一個人運動好孤單？揪團一起流汗，更有動力！',
    '揮灑汗水不孤單，揪個伴一起燃燒卡路里！',
    '運動不再是獨角戲！發起揪人，讓我們一起揪團運動！',
    '別再說沒時間運動了！揪個附近的夥伴，隨時動起來！',
  ],
  3: [ // 遊戲
    '今晚想開哪一局? PC Game, 手遊, 還是Switch？一起來組隊開戰!',
    '找不到隊友Carry全場嗎？發起揪人遊戲，找到你的神隊友同學！',
    '麻將/牌局三缺一？趕快發起揪人遊戲，快樂的時光不等人！',
    '想找人一起挑戰密室逃脫，考驗你們的默契與智慧嗎？由你來發起一場驚險刺激的解謎之旅吧！',
    '創建一個新的揪人遊戲，可能是歡樂的派對遊戲、燒腦的策略遊戲，或是輕鬆的合作遊戲，讓大家一起面對面同樂！',
    '找不到和你一樣熱愛某款遊戲的夥伴嗎？別灰心，你也可以成為發起人，創建一個專屬於你們的小天地！',
  ],
  4: [ // 讀書
    '不想再當獨行俠？快找人一起讀書，互相激勵！',
    '讀書不再孤單！發起讀書會，和大家一起學習！',
    '上課睡著啦？別擔心，揪人一起討論，讀書效率加倍!',
    '考試快到了？一起讀書，互相督促！一起抱佛腳也不錯（？）',
    '讀書不再是孤獨的旅程！發起讀書會，一起探索知識的海洋！',
  ],
};

export default textForEvents;